vvpai9/Keil/Keil_v5/ARM/Pack/.Web/TexasInstruments.MSPM0H321X_DFP.pdsc
                        __ap = 4;
                        ACCESS_POINT_VAL = ReadAP(0x00);//Reading current state of access point
                        Message(0, "Current state of access point is: %x",ACCESS_POINT_VAL);
                        WriteAP(0x00, 0x100008);
                        DAP_Delay(5000);
                    </block>
                    <block>
                        __var nReset = 0x80;
                        __var canReadPins = 0;
                        __var BOOTDIAG_READ = 0;
                        __var AHB_STATUS = 0;
                        __ap = 1;
                        BOOTDIAG_READ = ReadAP(0x10);
                        __ap = 0;
                        AHB_STATUS = ReadAP(0xFC);
                        __ap = 4;
                    </block>
                    <control if = "(BOOTDIAG_READ == 0x07)">
                        <!-- If the AHB IDR can be read then we do nothing, otherwise there is an issue-->
                        <control if = "!AHB_STATUS">
                            <block>
                                Query(0, "Cannot view the AHB-AP, debug access has been disabled or nested exception occured. Please reset the device.",1);
                            </block>
                        </control>
                    </control>
                    <control if = "(BOOTDIAG_READ == 0x36)">
                        <!-- NONMAIN has been corrupted due to a possiblity of several reason but device cannot be accessed-->
                        <block>
                            Query(0, "NONMAIN has been corrupted, this can be caused by erasing without programming, invalid BCR/BSL CRC value, or incorrectly modifying NONMAIN",1);
                        </block>
                    </control>
                    <control if = "(BOOTDIAG_READ == 0x0004110A)">
                        <block>
                            // De-assert nRESET line to activate the hardware reset
                            canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
                        </block>
                        <!-- Keep reset active for 50 ms -->
                        <control while="1" timeout="200"/>
                        <control if="canReadPins">
                            <!-- Assert nRESET line and wait max. 1s for recovery -->
                            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
                        </control>
                        <control if="!canReadPins">
                            <block>
                            // Assert nRESET line
                            DAP_SWJ_Pins(nReset, nReset, 0);
                            </block>
                            <!-- Wait 100ms for recovery if nRESET not readable -->
                            <control while="1" timeout="100000"/>
                        </control>
                    </control>
                    <control if = "(ACCESS_POINT_VAL &amp; 0x00E00000) == 0">
                        <block>
                            WriteAP(0x00, 0x190008);
                            WriteAP(0xF0, 0x01);
                        </block> 
                    </control>
                    <control if = "(ACCESS_POINT_VAL &amp; 0x00E00000) != 0">
                        <block>
                            WriteAP(0xF0, 0x01);
                            WriteAP(0x00, 0xF90008);
                            WriteAP(0xF0, 0x01);
                        </block>
                    </control>
                    <block>
                        ACCESS_POINT_VAL = ReadAP(0x00);//Reading current state of access point
                        Message(0, "Current state of access point is: %x",ACCESS_POINT_VAL);
                        __ap = 0; //lets make sure we reset the access point selection
                    </block>
                </sequence>
                <sequence name="DebugDeviceUnlock">
                    <block>
                        __ap = 1;
                        __var deviceID = 0;
                        __var version = 0;
                        __var partNum = 0;
                        __var manuf = 0;
                        __var isMSPM0H321X = 0;
                        __var isProduction = 0;
                        __var continueId = 0;
                        deviceID =  ReadAP(0x00);
                        version = deviceID >> 28;
                        partNum = (deviceID &amp; 0x0FFFF000) >> 12;
                        manuf = (deviceID &amp; 0x00000FFE) >> 1;
                        isMSPM0H321X = (partNum == 0xBBAF) &amp;&amp; (manuf == 0x17);
                        isProduction = (version &gt; 0);
                    </block>
                    <!-- Check if device ID is correct -->
                    <control if="!isMSPM0H321X">
                        <block>
                            continueId = Query(1, "Incorrect ID. This support package is for MSPM0H321X devices. Continue?", 4);
                        </block>
                    </control>
                    <control if="continueId == 4">
                        <block>
                            Message(2, "Invalid ID");
                        </block>
                    </control>
                    <!-- Check if the device is early sample material -->
                    <control if="!isProduction">
                        <block>
                            Query(0, "This support package doesn't support MSPM0 early samples. We recommend moving to production-quality MSPM0H321X silicon by ordering samples at www.ti.com/mspm0.", 0);
                            Message(2, "Invalid device revision");
                        </block>
                    </control>
                </sequence>
                <sequence name="ResetSystem">
                    <block>
                        // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
                        __ap = 4;
                        WriteAP(0xF0, 0x01);
                        DAP_Delay(20000); 
                    </block>
                    <block>
                        // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
                        __var SCS_Addr   = 0xE000E000;
                        __var AIRCR_Addr = SCS_Addr + 0xD0C;
                        __var DHCSR_Addr = SCS_Addr + 0xDF0;
                
                        // Execute SYSRESETREQ via AIRCR
                        Write32(AIRCR_Addr, 0x05FA0004);
                    </block>
                    <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
                    <control while="(Read32(DHCSR_Addr) &amp; 0x02000000)" timeout="500000"/>
                </sequence>
            </sequences>
            <!-- features common for the whole family -->
            <feature type="NVIC" n="32" name="Nested Vectored Interrupt Controller (NVIC)"/>
            <feature type="DMA" n="3" name="Direct Memory Access (DMA)"/>
            <feature type="MemoryOther" name="Up to 64KB Flash memory with built-in error correction code (ECC)"/>
            <feature type="MemoryOther" name="Up to 8KB SRAM with hardware parity"/>
            <feature type="RTC" n="32768" name="Internal RTC with alarm and calendar modes"/>
            <feature type="ClockOther" name="Internal 32MHz oscillator with +-1% accuracy (SYSOSC)"/>
            <feature type="ClockOther" name="Internal 32kHz oscillator (LFOSC)"/>
            <feature type="PowerMode" n="12" name="RUN0, RUN1, RUN2, SLEEP0, SLEEP1, SLEEP2, STOP0, STOP2, STANDBY0, STANDBY1"/>
            <feature type="VCC" n="4.5" m="5.5"/>
            <feature type="Temp" n="-40" m="125" name="Extended Operating Temperature Range"/>
<!-- ************************  Subfamily MSPM0H321X  **************************** -->
            <subFamily DsubFamily="MSPM0H321X">
                <feature type="AnalogOther" n="1" name="General-purpose amplifier (GPAMP)"/>
                <feature type="AnalogOther" n="1" name="Configurable 1.4V or 2.5V internal shared voltage reference (VREF)"/>
                <feature type="Timer" n="8" m="16" name="One 16-bit advanced timers with deadband supporting up to 8 PWM channels"/>
                <feature type="TimerOther" n="1" name="16-bit general purpose timer with 4 capture/compare channels"/>
                <feature type="TimerOther" n="2" name="16-bit general purpose timer with 2 capture/compare channels"/>
                <feature type="TimerOther" n="1" name="16-bit general purpose timer with 2 capture/compare channels and supporting QEI"/>
                <feature type="WDT" n="1" name="Window-watchdog timer"/>
                <feature type="WDT" n="1" name="Indepenent watchdog timer"/>
                <feature type="I2C" n="2" name="I2C interface supporting up to FM+ (1Mbps), SMBus/PMBus, and wakeup from STOP mode"/>
                <feature type="SPI" n="1" m="16000000" name="SPI interface"/>
                <feature type="UART" n="3" name="UART inteface, one supporting LIN, IrDA, DALI, Smart Card, Manchester, and three supporting low-power operation in STANDBY mode"/>
                <feature type="ADC" n="27" m="10" name="One analog-to-digital converter with up to 27 total external channels (ADC)"/>
                <feature type="IOs" n="45" name="General purpose I/Os"/>
                <!-- *************************  Device MSPM0H3216  ***************************** -->
                <device Dname="MSPM0H3216">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00010000" startup="1" default="1"/>
                    <memory     name="IROM2" access="rx"  start="0x00400000" size="0x00010000" default="0" alias="IROM1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00002000" default="0"/>
                    <memory     name="IRAM_Parity" access="rwx" start="0x20100000" size="0x00002000" default="0" alias="IRAM1"/>
                    <memory     name="IRAM_No_Parity" access="rwx" start="0x20200000" size="0x00002000" default="1" alias="IRAM1"/>
                    <memory     name="IRAM_Parity_Code" access="rwx" start="0x20300000" size="0x00002000" default="0" alias="IRAM1"/>
                    <memory     name="NonMain_ECC" access="r"  start="0x41C00000" size="0x00000200" default="1"/>
                    <memory     name="NonMain_noECC" access="r"  start="0x41C10000" size="0x00000200" default="0" alias="NonMain_ECC"/>
                    <memory     name="Factory_ECC" access="r"  start="0x41C40000" size="0x00000080" default="1"/>
                    <memory     name="Factory_noECC" access="r"  start="0x41C50000" size="0x00000080" default="0" alias="Factory_ECC"/>
                    <compile    define="__MSPM0H3216__"/>
                    <debug      svd="03_SVD/MSPM0H321X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0H321X_MAIN_64KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00002000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0H321X_NONMAIN.FLM" start="0x41C00000" size="0x00000200" RAMstart="0x20000000" RAMsize="0x00002000" default="0"/>
                </device>
                <!-- *************************  Device MSPM0H3215  ***************************** -->
                <device Dname="MSPM0H3215">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00008000" startup="1" default="1"/>
                    <memory     name="IROM2" access="rx"  start="0x00400000" size="0x00008000" default="0" alias="IROM1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00008000" default="0"/>
                    <memory     name="IRAM_Parity" access="rwx" start="0x20100000" size="0x00002000" default="0" alias="IRAM1"/>
                    <memory     name="IRAM_No_Parity" access="rwx" start="0x20200000" size="0x00002000" default="1" alias="IRAM1"/>
                    <memory     name="IRAM_Parity_Code" access="rwx" start="0x20300000" size="0x00002000" default="0" alias="IRAM1"/>
                    <memory     name="NonMain_ECC" access="r"  start="0x41C00000" size="0x00000200" default="1"/>
                    <memory     name="NonMain_noECC" access="r"  start="0x41C10000" size="0x00000200" default="0" alias="NonMain_ECC"/>
                    <memory     name="Factory_ECC" access="r"  start="0x41C40000" size="0x00000080" default="1"/>
                    <memory     name="Factory_noECC" access="r"  start="0x41C50000" size="0x00000080" default="0" alias="Factory_ECC"/>
                    <compile    define="__MSPM0H3215__"/>
                    <debug      svd="03_SVD/MSPM0H321X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0H321X_MAIN_32KB.FLM" start="0x00000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00002000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0H321X_NONMAIN.FLM" start="0x41C00000" size="0x00000200" RAMstart="0x20000000" RAMsize="0x00002000" default="0"/>
                </device>
            </subFamily>
        </family>
    </devices>

    <boards>
        <board vendor="TexasInstruments" name="LP-MSPM0H3216" salesContact="http://www.ti.com/general/docs/contact.tsp">
            <description>MSPM0H3216 LaunchPad</description>
            <mountedDevice    deviceIndex="0" Dvendor="Texas Instruments:16" Dname="MSPM0H3216"/>
            <compatibleDevice deviceIndex="0" Dvendor="Texas Instruments:16" Dfamily="MSPM0H321X Series" DsubFamily="MSPM0H321X"/> 
            <debugInterface adapter="XDS110-ET" connector="XDS110-ET Onboard Emulator"/>  
            <debugInterface adapter="SWD" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
            <feature type="USB" n="1" name="USB Device,  Micro-B receptacle"/>
            <feature type="Button" n="3" name="reset and two user push-buttons"/>
            <feature type="LED" n="4" name="LEDs for user interaction, including 1 RGB LED"/> 
            <feature type="ConnOther" n="2" name="40 pin BoosterPack Connector and support for 20 pin BoosterPacks"/>
            <feature type="TempSens" n="1" name="Temperature sensor circuit"/>
            <feature type="LightSens" n="1" name="Light sensor circuit"/>
            <feature type="SensOther" n="1" name="External OPA2365 for 4MSPS ADC evaluation"/>
            <feature type="XTAL" n="48000000"/>
            <feature type="Other" name="EnergyTrace technology available for ultra-low-power debugging"/>
            <feature type="Other" name="32kHz crystal"/>
        </board>
    </boards>

</package>
